usb-c/STUSB1602/firmware/FW_for_STM32F446/src/Drivers/BSP/P-NUCLEO-F446/p-nucleo-F446.h
/**
  ******************************************************************************
  * @file    p-nucleo-F446.h
  * @author  MCD Application Team
  * @brief   This file contains the headers of p-nucleo-usb002.c file.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2017 STMicroelectronics International N.V. 
  * All rights reserved.</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without 
  * modification, are permitted, provided that the following conditions are met:
  *
  * 1. Redistribution of source code must retain the above copyright notice, 
  *    this list of conditions and the following disclaimer.
  * 2. Redistributions in binary form must reproduce the above copyright notice,
  *    this list of conditions and the following disclaimer in the documentation
  *    and/or other materials provided with the distribution.
  * 3. Neither the name of STMicroelectronics nor the names of other 
  *    contributors to this software may be used to endorse or promote products 
  *    derived from this software without specific written permission.
  * 4. This software, including modifications and/or derivative works of this 
  *    software, must execute solely and exclusively on microcontroller or
  *    microprocessor devices manufactured by or for STMicroelectronics.
  * 5. Redistribution and use of this software other than as permitted under 
  *    this license is void and will automatically terminate your rights under 
  *    this license. 
  *
  * THIS SOFTWARE IS PROVIDED BY STMICROELECTRONICS AND CONTRIBUTORS "AS IS" 
  * AND ANY EXPRESS, IMPLIED OR STATUTORY WARRANTIES, INCLUDING, BUT NOT 
  * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A 
  * PARTICULAR PURPOSE AND NON-INFRINGEMENT OF THIRD PARTY INTELLECTUAL PROPERTY
  * RIGHTS ARE DISCLAIMED TO THE FULLEST EXTENT PERMITTED BY LAW. IN NO EVENT 
  * SHALL STMICROELECTRONICS OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
  * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
  * LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, 
  * OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF 
  * LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING 
  * NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
  * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
/*#warning "P-Nucleo header bof"*/
#ifndef __P_NUCLEO_F4_H_
#define __P_NUCLEO_F4_H_
/*#warning "P-Nucleo header bof2"*/
#ifdef __cplusplus
extern "C"
{
#endif
 
/**
  * @addtogroup BSP
  * @{
  * */

/**
  * @addtogroup P-NUCLEO-USB002
  * @{
  * */

/* Includes ------------------------------------------------------------------*/
#if defined(STM32F446xx)

#include "stm32f4xx.h"
#include "stm32f4xx_ll_utils.h"
#include "stm32f4xx_ll_system.h"
#include "stm32f4xx_ll_rcc.h"
#include "stm32f4xx_ll_cortex.h"
#include "stm32f4xx_ll_exti.h" 
#include "stm32f4xx_ll_bus.h"
#include "stm32f4xx_ll_tim.h"
#include "stm32f4xx_ll_usart.h"
#include "stm32f4xx_ll_crc.h"
#include "stm32f4xx_ll_dac.h"
#include "stm32f4xx_ll_cortex.h"  
#include "stm32f4xx_ll_gpio.h"
#include "stm32f4xx_ll_dma.h"  
#include "stm32f4xx_ll_pwr.h"
#if defined(_OPTIM_CONSO)
#include "stm32f4xx_ll_rtc.h"
#include "stm32f4xx_ll_exti.h"
#include "stm32f4xx_ll_adc.h"
#endif /* _OPTIM_CONSO_ */  
#else
#error "Add include for the family!"
#endif

  
#define TIMx                           TIM8
#if defined(USE_USB_FS)
#define TIMx_Clock_Freq                (SystemCoreClock * 2)/2       /* depend on APB clock freq timer is connected */
#else 
#define TIMx_Clock_Freq                (SystemCoreClock * 2)/2       /* depend on APB clock freq timer is connected */
#endif   
#define TIMx_CLK_ENABLE                __HAL_RCC_TIM8_CLK_ENABLE()
 
#define FLASH_BANK1_END FLASH_END 
#define FLASH_PAGE_SIZE 0x1FFFF
/** @defgroup P-NUCLEO-USB001_Exported_Macros Exported Macros
  * @{
  */
#define USBPD_BSP_PIN(PORT,PIN)    { PORT, GPIO_PIN_ ## PIN, 0 }
#define USBPD_BSP_ADC(PORT,PIN,CH,RANK) { PORT, GPIO_PIN_ ## PIN, CH, RANK }
  
#define USBPD_LOWEST_IRQ_PRIO   15   /*!< Lowest priority                    */
#define USBPD_LOW_IRQ_PRIO      10   /*!< High priority shift value          */
#define USBPD_HIGH_IRQ_PRIO     5   /*!< Low priority shift value           */
#define RX_IRQ_PRIO             6   /*!< Rx priority for first interrupt @note Communication is half duplex so @ref TX_IRQ_PRIO = @ref RX_IRQ_PRIO */
#define TX_IRQ_PRIO             6   /*!< Tx interrupt priority @note Communication is half duplex so @ref TX_IRQ_PRIO = @ref RX_IRQ_PRIO */

/**
  * @brief This struct contains parameter used to define array of pins
  */
typedef struct
{
      GPIO_TypeDef*   GPIOx;      /*!< The GPIO Port of the Pin */
      uint16_t        GPIO_Pin;   /*!< The GPIO_Pin */
      uint32_t        ADCCH;      /*!< The ADC Channel if used */
} USBPD_BSP_GPIOPins_TypeDef;

typedef struct
{
      GPIO_TypeDef*   GPIOx;      /*!< The GPIO Port of the Pin */
      uint16_t        GPIO_Pin;   /*!< The GPIO_Pin */
      uint32_t        ADCCH;      /*!< The ADC Channel if used */
      uint32_t        RANK;       /*!< The ADC Rank if used */
} USBPD_BSP_GPIOADCPins_TypeDef;

void USBPD_HW_IF_GPIO_Set(USBPD_BSP_GPIOPins_TypeDef gpio, GPIO_PinState PinState);
void USBPD_HW_IF_GPIO_On(USBPD_BSP_GPIOPins_TypeDef gpio);
void USBPD_HW_IF_GPIO_Off(USBPD_BSP_GPIOPins_TypeDef gpio);
void USBPD_HW_IF_GPIO_Toggle(USBPD_BSP_GPIOPins_TypeDef gpio);

/**
  * @}
  */

/** @defgroup P-NUCLEO-USB002_Exported_Types Exported Types
  * @{
  */
/** @defgroup USBPD_DEVICE_PORTHANDLE_STUSB1602_IOs STUSB1602 IOs
  *   @brief All those macro are used to define the HW setup on MCU side
  * @{
  */

/* GPIOs */
#define TX_EN_GPIO_PORT(__PORT__)           ( GPIOC )                                       /*!< TX_EN GPIO Port           */
#define TX_EN_GPIO_PIN(__PORT__)            ((__PORT__ == 0) ? GPIO_PIN_2 : GPIO_PIN_3 )    /*!< TX_EN GPIO Pin            */
#define RESET_GPIO_PORT(__PORT__)           ( GPIOC )                                       /*!< RESET GPIO Port           */
#define RESET_GPIO_PIN(__PORT__)            ((__PORT__ == 0) ? GPIO_PIN_6 : GPIO_PIN_7 )    /*!< RESET GPIO PIN            */
#define A_B_Side_GPIO_PORT(__PORT__)        ( GPIOA )                                       /*!< A_B Side GPIO Port        */
#define A_B_Side_GPIO_PIN(__PORT__)         ((__PORT__ == 0) ? GPIO_PIN_0 : GPIO_PIN_3 )    /*!< A_B Side GPIO Pin         */
#define ALERT_PORT_INDEX(__PORT__)          ((__PORT__ == 0) ? 0 : 1 )                      /*!< ALERT Pin index           */
#define ALERT_GPIO_PORT(__PORT__)           ( GPIOA )                                       /*!< ALERT GPIO Port           */
#define ALERT_GPIO_PIN(__PORT__)            ((__PORT__ == 0) ? GPIO_PIN_1 : GPIO_PIN_2 )    /*!< ALERT GPIO Pin            */
#define ALERT_GPIO_IRQHANDLER(__PORT__)     ((__PORT__ == 0) ? EXTI1_IRQn : EXTI2_IRQn )/*!< ALERT GPIO IRQn           */
#define ALERT_GPIO_IRQPRIORITY(__PORT__)    ( USBPD_LOW_IRQ_PRIO )                          /*!< ALERT IRQ priority        */

/* I2C */
#define I2C_INSTANCE(__PORT__)              ( I2C2 )                    /*!< I2C: Device           */
#define I2C_CLOCKSPEED(__PORT__)            (400000)
#define I2C_PORT(__PORT__)                  ( GPIOB )                   /*!< I2C: GPIO Port        */
#define I2C_SCL_PIN(__PORT__)               ( GPIO_PIN_10 )             /*!< I2C: SCL Pin          */
#define I2C_SCL_PORT(__PORT__)              ( GPIOB )                   /*!< I2C: SCL Port         */
#define I2C_SDA_PIN(__PORT__)               ( GPIO_PIN_11 )             /*!< I2C: SDA Pin          */
#define I2C_SDA_PORT(__PORT__)              ( GPIOB )                   /*!< I2C: SDA Port         */
#define I2C_MODE(__PORT__)                  ( GPIO_MODE_AF_OD )         /*!< I2C: GPIO Mode        */
#define I2C_PULL(__PORT__)                  ( GPIO_NOPULL )             /*!< I2C: Pull setup       */
#define I2C_ALTERNATE(__PORT__)             ( GPIO_AF4_I2C2 )           /*!< I2C: GPIO AF          */
#define I2C_IP_SPEED(__PORT__)              ( GPIO_SPEED_FREQ_HIGH )	/*!< I2C: GPIO Speed       */


/* SPI */
#define SPI_Instance(__PORT__)                  ((__PORT__ == 0) ? SPI2                  : SPI1 )                   /*!< SPI: Device           */
#define SPI_NSS_PORT(__PORT__)                  ((__PORT__ == 0) ? GPIOB                 : GPIOA )                  /*!< SPI: NSS Port         */
#define SPI_NSS_PIN(__PORT__)                   ((__PORT__ == 0) ? GPIO_PIN_12           : GPIO_PIN_15 )            /*!< SPI: NSS Pin          */
#define SPI_NSS_LL_APB(__PORT__)                ((__PORT__ == 0) ? LL_APB1_GRP1_PERIPH_SPI2  : LL_APB2_GRP1_PERIPH_SPI1 )  /*!< SPI: NSS LL Group     */
#define SPI_NSS_LL_PORT(__PORT__)               ((__PORT__ == 0) ? LL_SYSCFG_EXTI_PORTB  : LL_SYSCFG_EXTI_PORTA )   /*!< SPI: NSS LL Port      */
#define SPI_NSS_LL_SYS_EXTI(__PORT__)           ((__PORT__ == 0) ? LL_SYSCFG_EXTI_LINE12 : LL_SYSCFG_EXTI_LINE15 )  /*!< SPI: NSS LL CFG EXTI Line */
#define SPI_NSS_LL_EXTI(__PORT__)               ((__PORT__ == 0) ? LL_EXTI_LINE_12 : LL_EXTI_LINE_15 )              /*!< SPI: NSS LL EXTI Line */
                                               /*!< SPI: NSS LL IRQn      */
#define SPI_NSS_LL_IRQPRIORITY(__PORT__)        ( RX_IRQ_PRIO )                            /*!< SPI: NSS LL IRQ priority */
#define SPI_NSS_LL_APB_EN_CLK(__PORT__)         ((__PORT__ == 0) ? LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_SPI2)  : LL_APB2_GRP1_EnableClock(LL_APB2_GRP1_PERIPH_SPI1) )
#define SPI_NSS_LL_APB_DIS_CLK(__PORT__)        ((__PORT__ == 0) ? LL_APB1_GRP1_DisableClock(LL_APB1_GRP1_PERIPH_SPI2)  : LL_APB2_GRP1_DisableClock(LL_APB2_GRP1_PERIPH_SPI1) )

#define SPI_CLK_PORT(__PORT__)                  ( GPIOB )                                                           /*!< SPI: CLK Port         */
#define SPI_MISO_PORT(__PORT__)                 ( GPIOB )                                                           /*!< SPI: MISO Port        */
#define SPI_CLK_PIN(__PORT__)                   ((__PORT__ == 0) ? GPIO_PIN_13           : GPIO_PIN_3 )             /*!< SPI: CLK Pin          */
#define SPI_MISO_PIN(__PORT__)                  ((__PORT__ == 0) ? GPIO_PIN_14           : GPIO_PIN_4 )             /*!< SPI: MISO Pin         */
#if !defined(SPI_ONE_LINE)
#define SPI_MOSI_PORT(__PORT__)                 ( GPIOB )                                                           /*!< SPI: MOSI Port        */
#define SPI_MOSI_PIN(__PORT__)                  ((__PORT__ == 0) ? GPIO_PIN_15           : GPIO_PIN_5 )             /*!< SPI: MOSI Pin         */
#define SPI_MOSI_ALTERNATE(__PORT__)            ((__PORT__ == 0) ? GPIO_AF5_SPI2         : GPIO_AF5_SPI1 )          /*!< SPI: MOSI Alternate Function */
#endif
#define SPI_NSS_LL_IRQHANDLER(__PORT__)         ( EXTI15_10_IRQn ) 
#define SPI_CLK_ALTERNATE(__PORT__)             ((__PORT__ == 0) ? GPIO_AF5_SPI2         : GPIO_AF5_SPI1 )          /*!< SPI: CLK Alternate Function */
#define SPI_NSS_ALTERNATE(__PORT__)             ((__PORT__ == 0) ? GPIO_AF5_SPI2         : GPIO_AF5_SPI1 )          /*!< SPI: NSS Alternate Function */
#define SPI_MISO_ALTERNATE(__PORT__)            ((__PORT__ == 0) ? GPIO_AF5_SPI2         : GPIO_AF5_SPI1 )          /*!< SPI: MISO Alternate Function */
/* Definition for SPIx's NVIC */
#define SPI_IRQn(__PORT__)                       ((__PORT__ == 0) ? SPI2_IRQn            : SPI1_IRQn )
#define SPIx_IRQHandler(__PORT__)                ((__PORT__ == 0) ? SPI2_IRQHandler      : SPI1_IRQHandler )
#define SPIx_IRQ_PRIO(__PORT__)                 ( USBPD_HIGH_IRQ_PRIO )    /*!< SPI: IRQ priority  must be higher    */


/* DMA */
#define TX_DMACH(__PORT__)                       ((__PORT__ == 0) ? DMA_CHANNEL_0     : DMA_CHANNEL_3 )       /*!< DMA: Tx Channel  */
#define TXDMACHIRQ(__PORT__)                     ((__PORT__ == 0) ? DMA1_Stream4_IRQn : DMA2_Stream3_IRQn)         /*!< DMA: IRQn        */
#define TX_DMASTREAM(__PORT__)                   ((__PORT__ == 0) ? DMA1_Stream4      : DMA2_Stream3)                         /*!< DMA: Stream      */


