usb-c/STUSB1602/firmware/FW_for_STM32F446/src/Drivers/BSP/P-NUCLEO-F446/p-nucleo-F446.h
#define RX_DMACH(__PORT__)                       ((__PORT__ == 0) ? DMA_CHANNEL_0     : DMA_CHANNEL_3 )       /*!< DMA: Tx Channel  */
#define RXDMACHIRQ(__PORT__)                     ((__PORT__ == 0) ? DMA1_Stream3_IRQn : DMA2_Stream2_IRQn)         /*!< DMA: IRQn        */
#define RX_DMASTREAM(__PORT__)                   ((__PORT__ == 0) ? DMA1_Stream3      : DMA2_Stream2)                         /*!< DMA: Stream      */

#define TXDMACHIRQ_PRIO(__PORT__)                  (TX_IRQ_PRIO )                              /*!< DMA: IRQ priority     */
#define TXDMACHIRQ_SUB_PRIO(__PORT__)              (1)                              /*!< DMA: IRQ priority     */
#define RXDMACHIRQ_PRIO(__PORT__)                  (RX_IRQ_PRIO )                              /*!< DMA: IRQ priority     */
#define RXDMACHIRQ_SUB_PRIO(__PORT__)              (0)                              /*!< DMA: IRQ priority     */

#define SPARE_BIT_SUB_CORRECTION                 2
#define PHY_TXRX_BYTE_TIMEOUT                    50  /*!< Max time to recieve or send a byte Time Elapsed value [us]       */
#define SWCALL_RX_STOP(PORT)  LL_EXTI_GenerateSWI_0_31( SPI_NSS_PIN(PORT)) /* Macro Generating SWIE */
/**
  * @}
  */

/** @defgroup USBPD_DEVICE_PORTHANDLE_STUSB1602_MSP_MACRO MSP MACRO
  * @brief MACRO used by HAL MSP function to identify peripherals
 * @{
 */
#define GET_PORT_FROM_I2C(hi2c) \
( (uint8_t)( hi2c->Instance == I2C2)? 0 : 1 )   /*!< GET Port Number from I2C peripheral   */

#define I2C_CLK_ENABLE(PortNum) do { \
if (PortNum==0) \
  __HAL_RCC_I2C2_CLK_ENABLE(); \
else \
  __HAL_RCC_I2C2_CLK_ENABLE();  \
} while(0)                                      /*!< Enables Clock of I2C peripheral for the specified port  */

#define I2C_CLK_DISABLE(PortNum) do { \
if (PortNum==0) \
  __HAL_RCC_I2C2_CLK_DISABLE(); \
else \
  __HAL_RCC_I2C2_CLK_DISABLE();  \
} while(0)                                      /*!< Disables Clock of I2C peripheral for the specified port */

#define GET_PORT_FROM_SPI(hspi) \
( (uint8_t)( hspi->Instance == SPI_Instance(0) )? 0 : 1 )  /*!< GET Port Number from SPI peripheral   */

#define SPI_CLK_ENABLE(PortNum) do { \
if (PortNum==0) \
  __HAL_RCC_SPI2_CLK_ENABLE(); \
else \
  __HAL_RCC_SPI1_CLK_ENABLE();  \
} while(0)                                      /*!< Enables Clock of SPI peripheral for the specified port  */

#define SPI_CLK_DISABLE(PortNum) do { \
if (PortNum==0) \
  __HAL_RCC_SPI2_CLK_DISABLE(); \
else \
  __HAL_RCC_SPI1_CLK_DISABLE();  \
} while(0)                                      /*!< Disables Clock of SPI peripheral for the specified port */

#define SPI_FORCE_RESET(PortNum) do { \
if (PortNum==0) \
  __HAL_RCC_SPI2_FORCE_RESET(); \
else \
  __HAL_RCC_SPI1_FORCE_RESET();  \
} while(0) 

#define SPI_RELEASE_RESET(PortNum) do { \
if (PortNum==0) \
  __HAL_RCC_SPI2_RELEASE_RESET(); \
else \
  __HAL_RCC_SPI1_RELEASE_RESET();  \
} while(0) 
#define DMA_CLK_ENABLE(PortNum) do { \
if (PortNum==0) \
  __HAL_RCC_DMA1_CLK_ENABLE(); \
else \
  __HAL_RCC_DMA2_CLK_ENABLE();   \
} while(0)                                      /*!< Enables Clock of DMA peripheral for the specified port  */

#define DMA_CLK_DISABLE(PortNum) do { \
if (PortNum==0) \
  __HAL_RCC_DMA1_CLK_DISABLE(); \
else \
  __HAL_RCC_DMA2_CLK_DISABLE();   \
} while(0)                                      /*!< Disables Clock of DMA peripheral for the specified port */


#define TIM_CRC(TIM_identifier) ((TIM_identifier == TIM_PORT0_CRC )? TIM_PORT0_CRC:TIM_PORT1_CRC)

#define STUSB1602_I2C_Add_0     					0x28 	/*<! Address 0 */
#define STUSB1602_I2C_Add_1     					0x29	/*<! Address 1 */
#define TIMEOUT_MAX             2000 /*<! The value of the maximal timeout for BUS waiting loops */

#define STUSB1602_I2C_Add(__PORT__)		((__PORT__ == 0) ? STUSB1602_I2C_Add_0 : STUSB1602_I2C_Add_1 )	/*!< I2C Address of the STUSB1602 device */


/**
  * @brief Leds on board P_NUCLEO_USB002
  *
  */ 
  typedef enum
  {
    ELED  = -1,
    ELED0 = 0,       /**<LED1 (green);  D107 of MB1303 X-NUCLEO */
    
    ELED1 = 1,       /**<LED01 (blue);  D100 of MB1303 X-NUCLEO */
    ELED2 = 2,       /**<LED02 (green); D101 of MB1303 X-NUCLEO */
    ELED3 = 3,       /**<LED03 (red);   D102 of MB1303 X-NUCLEO */
    
    ELED4 = 4,       /**<LED11 (blue);  D103 of MB1303 X-NUCLEO */
    ELED5 = 5,       /**<LED12 (green); D104 of MB1303 X-NUCLEO */
    ELED6 = 6,       /**<LED13 (red);   D105 of MB1303 X-NUCLEO */

    /* BSP name list */
    GREEN_USER_LED      = ELED0,

    LED_PORT0_CC        = ELED3,
    LED_PORT0_VBUS      = ELED2,
#if defined(__AUTHENTICATION__)
    /* In case of Authentication, LED01 and LED13 are mapped on 
       GPIOs used for I2C ST-SAFE communication. As only one port is handled,
       PORT0 Role is remapped on original PORT1 Role => ELED4 */
    LED_PORT0_ROLE      = ELED4,
#else
    LED_PORT0_ROLE      = ELED1,
#endif  /* __AUTHENTICATION__ */

    LED_PORT1_CC        = ELED6,
    LED_PORT1_VBUS      = ELED5,
    LED_PORT1_ROLE      = ELED4
  } USBPD_BSP_Led_TypeDef;

#define LED_PORT_ROLE(__PORT__) (__PORT__ == USBPD_PORT_0 ? LED_PORT0_ROLE : LED_PORT1_ROLE)  
#define LED_PORT_CC(__PORT__)   (__PORT__ == USBPD_PORT_0 ? LED_PORT0_CC : LED_PORT1_CC)
#define LED_PORT_VBUS(__PORT__) (__PORT__ == USBPD_PORT_0 ? LED_PORT0_VBUS : LED_PORT1_VBUS) 

#define DRP_pin                                 GPIO_PIN_8
#define DRP_port                                GPIOA


/**
  * @}
  */ 

#define BUTTONn                            1

/**
  * @brief User push-button
  */
#define USER_BUTTON_PIN                         GPIO_PIN_13
#define USER_BUTTON_GPIO_PORT                   GPIOC
#define USER_BUTTON_GPIO_CLK_ENABLE()         __HAL_RCC_GPIOC_CLK_ENABLE()   
#define USER_BUTTON_GPIO_CLK_DISABLE()        __HAL_RCC_GPIOC_CLK_DISABLE()  
#define USER_BUTTON_EXTI_LINE                   GPIO_PIN_13
#define USER_BUTTON_EXTI_IRQn                   EXTI15_10_IRQn
/* Aliases */
#define KEY_BUTTON_PIN                        USER_BUTTON_PIN
#define KEY_BUTTON_GPIO_PORT                  USER_BUTTON_GPIO_PORT
#define KEY_BUTTON_GPIO_CLK_ENABLE()          USER_BUTTON_GPIO_CLK_ENABLE()
#define KEY_BUTTON_GPIO_CLK_DISABLE()         USER_BUTTON_GPIO_CLK_DISABLE()
#define KEY_BUTTON_EXTI_LINE                  USER_BUTTON_EXTI_LINE
#define KEY_BUTTON_EXTI_IRQn                  USER_BUTTON_EXTI_IRQn

#define BUTTONx_GPIO_CLK_ENABLE(__INDEX__)    do { if((__INDEX__) == 0) USER_BUTTON_GPIO_CLK_ENABLE();} while(0)
#define BUTTONx_GPIO_CLK_DISABLE(__INDEX__)   (((__INDEX__) == 0) ? USER_BUTTON_GPIO_CLK_DISABLE() : 0)
/**
  * @}
  */ 

