usb-c/STUSB1602/firmware/FW_for_STM32F446/src/Drivers/BSP/P-NUCLEO-F446/p-nucleo-F446.h
typedef enum 
{  
  BUTTON_USER = 0,
  /* Alias */
  BUTTON_KEY  = BUTTON_USER
} Button_TypeDef;

typedef enum 
{  
  BUTTON_MODE_GPIO = 0,
  BUTTON_MODE_EXTI = 1
} ButtonMode_TypeDef; 
  
/* Exported define -----------------------------------------------------------*/
/** @defgroup P-NUCLEO-USB002_Exported_Constants Exported Constants     */


#define HW_IF_ADC        ADC1
/* ADC Exported define for MB1303 board */
#if (USBPD_PORT_COUNT == 1)
#define USBPD_ADCn    3                                    /*!< Number of Analog channel used by ADC */
#define USBPD_ADC_INT_CHANNEL    0          /*!< Number of internal channel used */     
#define ADCCONVERTEDVALUES_BUFFER_SIZE    USBPD_ADCn + USBPD_ADC_INT_CHANNEL /*!< Size of array containing ADC converted values: set to ADC sequencer number of ranks converted, to have a rank in each address */
#define VBUS_INDEX(__PORT__)    ( 2 )                      /*!< Index of the VBus channel for the specified Port inside @ref ADCxConvertedValues */
#define IBUS_INDEX(__PORT__)    ( 0 )                      /*!< Index of the IBus channel for the specified Port inside @ref ADCxConvertedValues */
#define VSRC_INDEX(__PORT__)    ( 1 )
#elif (USBPD_PORT_COUNT == 2)
#define USBPD_ADCn    5                                     /*!< Number of Analog channel used by ADC */
#define USBPD_ADC_INT_CHANNEL    0          /*!< Number of internal channel used */     
#define ADCCONVERTEDVALUES_BUFFER_SIZE    USBPD_ADCn + USBPD_ADC_INT_CHANNEL  /*!< Size of array containing ADC converted values: set to ADC sequencer number of ranks converted, to have a rank in each address */
#define VBUS_INDEX(__PORT__)    ((__PORT__ == 0) ? 4 : 2)  /*!< Index of the VBus channel for the specified Port inside @ref ADCxConvertedValues */
#define IBUS_INDEX(__PORT__)    ((__PORT__ == 0) ? 1 : 0)  /*!< Index of the IBus channel for the specified Port inside @ref ADCxConvertedValues */
#define VSRC_INDEX(__PORT__)     (3)
#endif
static const USBPD_BSP_GPIOADCPins_TypeDef USBPD_ADCs[USBPD_ADCn] =
{ 
#if (USBPD_PORT_COUNT == 1)
  USBPD_BSP_ADC(GPIOC, 4, ADC_CHANNEL_14,3), /*ADC0 on schematic - VBUS port0*/
  USBPD_BSP_ADC(GPIOA, 7, ADC_CHANNEL_7,1),  /*ADC1 on schematic - IBUS port0*/
  USBPD_BSP_ADC(GPIOC, 0, ADC_CHANNEL_10,2),  /*ADC4 on schematic - PowConn17*/
  
#elif (USBPD_PORT_COUNT == 2)
  USBPD_BSP_ADC(GPIOC, 4, ADC_CHANNEL_14,5), /*ADC0 on schematic - VBUS port0*/
  USBPD_BSP_ADC(GPIOA, 7, ADC_CHANNEL_7,2),  /*ADC1 on schematic - IBUS port0*/

  USBPD_BSP_ADC(GPIOB, 0, ADC_CHANNEL_8,3),  /*ADC2 on schematic - VBUS port1*/
  USBPD_BSP_ADC(GPIOA, 4, ADC_CHANNEL_4,1),  /*ADC3 on schematic - IBUS port1*/
  USBPD_BSP_ADC(GPIOC, 0, ADC_CHANNEL_10,4),  /*ADC4 on schematic - PowConn17*/
#endif

} ;

#if defined (P_NUCLEO_F4_C)
ADC_HandleTypeDef   usbpdm1_hadc;           /*!< Handle of ADC peripheral */
TIM_HandleTypeDef TimHandle;                /* Handle of external timer for TimerServer */
DMA_HandleTypeDef   DmaHandle;              /*!< Handle of DMA peripheral */
uint32_t   ADCxConvertedValues[ADCCONVERTEDVALUES_BUFFER_SIZE]; /*!< Array that stores ADC sampled values */
#else 
extern ADC_HandleTypeDef   usbpdm1_hadc;           /*!< Handle of ADC peripheral */
extern TIM_HandleTypeDef TimHandle;                             /* Handle of eternal timer for TimerServer */
extern DMA_HandleTypeDef   DmaHandle;              /*!< Handle of DMA peripheral */
extern uint32_t   ADCxConvertedValues[]; /*!< Array that stores ADC sampled values */
#endif 

/* Macro for ADCx DMA resources */

#define HW_IF_ADC        ADC1
#define ADCx_CLK_ENABLE()               __HAL_RCC_ADC1_CLK_ENABLE()         /*!< Enables clock of ADC device  */
#define ADCx_FORCE_RESET()              __HAL_RCC_ADC1_FORCE_RESET()        /*!< Forces reset of ADC device   */
#define ADCx_RELEASE_RESET()            __HAL_RCC_ADC1_RELEASE_RESET()      /*!< Releases reset of ADC device   */
#define ADCx_DMA_CLK_ENABLE()           __HAL_RCC_DMA2_CLK_ENABLE()         /*!< Enables clock of DMA device   */

#define ADCx_DMA                        DMA2_Stream0                       /*!< DMA stream for ADC F4      */
#define ADC_DMACH                       DMA_CHANNEL_0
#define TEMP(X)     ( ( ((uint32_t)X)*1024 )>>10 ) 
#define MVOLTAGE(X)  ( ( ( ( (uint32_t)X) * 3300 * (82+15)) >> 12 ) / 15 ) 

#define MVOLTVSRC(X)  ( ( ( ( (uint32_t)X) * 11 * 3300 ) ) >> 12 )
#define    codemax  (uint16_t) (4096*225/330)
#define MAMPIBUS(X)           (uint32_t) (X * 3000  / codemax)
#define MVOLTVINADC(X) ( ( ( ( (uint32_t)X) * 20151 ) ) >> 12 )
/**
 * 50Vs - VDDA/2 = Vadcin
 * */
#define MAMP(X)    (( (int32_t)((X*3300)>>10)-6600 ))      /*!< Macro to convert ADC value into mA  */

#if defined(USBPD_CLI)
#if defined (HAL_UART_MODULE_ENABLED) 
#if defined (P_NUCLEO_F4_C)
UART_HandleTypeDef huart_handle;
void USBPD_BSP_UART_Init(void);
#else 
extern UART_HandleTypeDef huart_handle;
extern void USBPD_BSP_UART_Init(void);
#endif 
#endif /* HAL_UART_MODULE_ENABLED */
#define USBPD_BSP_USART_IRQHandler              USART3_IRQHandler
#endif /* USBPD_CLI */

#define USBPD_BSP_LEDn                          7
#define USBPD_BSP_LED_LEN                       USBPD_BSP_LEDn

/**
  * @}
  */

#define USBPD_POWSELn    ((USBPD_PORT_COUNT) * 2)

static const USBPD_BSP_GPIOPins_TypeDef USBPD_POWSELs[USBPD_POWSELn] =
{
  USBPD_BSP_PIN(GPIOB,7),
  USBPD_BSP_PIN(GPIOB,6),
#if USBPD_PORT_COUNT == 2
  USBPD_BSP_PIN(GPIOC,1),
  USBPD_BSP_PIN(GPIOC,9),
#endif
};

/* Exported constants --------------------------------------------------------*/
/* Exported macro ------------------------------------------------------------*/
    
/* Exported variables --------------------------------------------------------*/

/* Exported functions --------------------------------------------------------*/
/** @addtogroup P-NUCLEO-USB002_Exported_Functions
  * @{
  */
#if defined(_GUI_INTERFACE)
const uint8_t*          BSP_GetHWBoardVersionName(void);
const uint8_t*          BSP_GetPDTypeName(void);
#endif /* _GUI_INTERFACE */

    /**
      * @brief  Configures P_NUCLEO_USB002 LED GPIO.
      * @param  None
      * @retval None
      */
    void USBPD_BSP_LED_Init(void);

    /**
      * @brief  Turns selected LED On.
      * @param  Led: Specifies the Led to be set on.
      * @retval None
      */
    void USBPD_BSP_LED_On(USBPD_BSP_Led_TypeDef Led);

    /**
      * @brief  Turns selected LED On or Off.
      * @param  Led: Specifies the Led to be set on.
      * @param  Value: value to set the led on or off.
      * @retval None
      */
    void USBPD_BSP_LED_Set(USBPD_BSP_Led_TypeDef Led, uint8_t Value);    
    
    /**
      * @brief  Turns selected LED Off.
      * @param  Led: Specifies the Led to be set off.
      * @retval None
      */
    void USBPD_BSP_LED_Off(USBPD_BSP_Led_TypeDef Led);

    /**
      * @brief  Toggles the selected LED.
      * @param  Led: Specifies the Led to be toggled.
      * @retval None
      */
    void USBPD_BSP_LED_Toggle(USBPD_BSP_Led_TypeDef Led);
    HAL_StatusTypeDef APPLI_Set_Current_Limit(uint8_t PortNum ,uint32_t IbusInmA);

void      BSP_PB_Init(Button_TypeDef Button, ButtonMode_TypeDef ButtonMode);
void      BSP_PB_DeInit(Button_TypeDef Button);
uint32_t  BSP_PB_GetState(Button_TypeDef Button);
    


/* STUSB16xx_EVAL exported function prototypes */
void            HW_IF_ADC_Init(void);
void            HW_IF_ADCAnalogGPIO_Init(void);
void            HW_IF_ADCAnalogGPIO_DeInit(void);
void            HW_IF_ADCDMA_Init(void);
void            HW_IF_ADCDMA_DeInit(void);



#ifndef MB1303
uint16_t APPLI_GetTemp(uint8_t PortNum);
uint16_t APPLI_GetVsrc(uint8_t PortNum);
#endif /*MB1303*/
int16_t APPLI_GetIvbus(uint8_t PortNum);
uint16_t APPLI_GetVBUS(uint8_t PortNum);
uint16_t APPLI_GetVINADC(uint8_t PortNum);

HAL_StatusTypeDef APPLI_SetVoltage(uint8_t PortNum ,uint32_t vbus_vvar);
void BSP_USBPD_SetVoltage(uint32_t Port, uint32_t Voltage);
/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#else
/*#warning "P-Nucleo header eof2"*/
#endif /* __P_NUCLEO_USB_F4_H_ */  
/*#warning "P-Nucleo header eof"*/

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
